GopalSaraf/Practicals/PSDL/include/proc/pic18lf2585.inc
// Register: B2SIDL
#define B2SIDL B2SIDL
B2SIDL                                   equ 0E42h
// bitfield definitions
B2SIDL_EID16_POSN                        equ 0000h
B2SIDL_EID16_POSITION                    equ 0000h
B2SIDL_EID16_SIZE                        equ 0001h
B2SIDL_EID16_LENGTH                      equ 0001h
B2SIDL_EID16_MASK                        equ 0001h
B2SIDL_EID17_POSN                        equ 0001h
B2SIDL_EID17_POSITION                    equ 0001h
B2SIDL_EID17_SIZE                        equ 0001h
B2SIDL_EID17_LENGTH                      equ 0001h
B2SIDL_EID17_MASK                        equ 0002h
B2SIDL_EXIDE_POSN                        equ 0003h
B2SIDL_EXIDE_POSITION                    equ 0003h
B2SIDL_EXIDE_SIZE                        equ 0001h
B2SIDL_EXIDE_LENGTH                      equ 0001h
B2SIDL_EXIDE_MASK                        equ 0008h
B2SIDL_SRR_POSN                          equ 0004h
B2SIDL_SRR_POSITION                      equ 0004h
B2SIDL_SRR_SIZE                          equ 0001h
B2SIDL_SRR_LENGTH                        equ 0001h
B2SIDL_SRR_MASK                          equ 0010h
B2SIDL_SID0_POSN                         equ 0005h
B2SIDL_SID0_POSITION                     equ 0005h
B2SIDL_SID0_SIZE                         equ 0001h
B2SIDL_SID0_LENGTH                       equ 0001h
B2SIDL_SID0_MASK                         equ 0020h
B2SIDL_SID1_POSN                         equ 0006h
B2SIDL_SID1_POSITION                     equ 0006h
B2SIDL_SID1_SIZE                         equ 0001h
B2SIDL_SID1_LENGTH                       equ 0001h
B2SIDL_SID1_MASK                         equ 0040h
B2SIDL_SID2_POSN                         equ 0007h
B2SIDL_SID2_POSITION                     equ 0007h
B2SIDL_SID2_SIZE                         equ 0001h
B2SIDL_SID2_LENGTH                       equ 0001h
B2SIDL_SID2_MASK                         equ 0080h
B2SIDL_EXID_POSN                         equ 0003h
B2SIDL_EXID_POSITION                     equ 0003h
B2SIDL_EXID_SIZE                         equ 0001h
B2SIDL_EXID_LENGTH                       equ 0001h
B2SIDL_EXID_MASK                         equ 0008h
B2SIDL_B2EID16_POSN                      equ 0000h
B2SIDL_B2EID16_POSITION                  equ 0000h
B2SIDL_B2EID16_SIZE                      equ 0001h
B2SIDL_B2EID16_LENGTH                    equ 0001h
B2SIDL_B2EID16_MASK                      equ 0001h
B2SIDL_B2EID17_POSN                      equ 0001h
B2SIDL_B2EID17_POSITION                  equ 0001h
B2SIDL_B2EID17_SIZE                      equ 0001h
B2SIDL_B2EID17_LENGTH                    equ 0001h
B2SIDL_B2EID17_MASK                      equ 0002h
B2SIDL_B2EXID_POSN                       equ 0003h
B2SIDL_B2EXID_POSITION                   equ 0003h
B2SIDL_B2EXID_SIZE                       equ 0001h
B2SIDL_B2EXID_LENGTH                     equ 0001h
B2SIDL_B2EXID_MASK                       equ 0008h
B2SIDL_B2SRR_POSN                        equ 0004h
B2SIDL_B2SRR_POSITION                    equ 0004h
B2SIDL_B2SRR_SIZE                        equ 0001h
B2SIDL_B2SRR_LENGTH                      equ 0001h
B2SIDL_B2SRR_MASK                        equ 0010h
B2SIDL_B2SID0_POSN                       equ 0005h
B2SIDL_B2SID0_POSITION                   equ 0005h
B2SIDL_B2SID0_SIZE                       equ 0001h
B2SIDL_B2SID0_LENGTH                     equ 0001h
B2SIDL_B2SID0_MASK                       equ 0020h
B2SIDL_B2SID1_POSN                       equ 0006h
B2SIDL_B2SID1_POSITION                   equ 0006h
B2SIDL_B2SID1_SIZE                       equ 0001h
B2SIDL_B2SID1_LENGTH                     equ 0001h
B2SIDL_B2SID1_MASK                       equ 0040h
B2SIDL_B2SID2_POSN                       equ 0007h
B2SIDL_B2SID2_POSITION                   equ 0007h
B2SIDL_B2SID2_SIZE                       equ 0001h
B2SIDL_B2SID2_LENGTH                     equ 0001h
B2SIDL_B2SID2_MASK                       equ 0080h
B2SIDL_B2EXIDE_POSN                      equ 0003h
B2SIDL_B2EXIDE_POSITION                  equ 0003h
B2SIDL_B2EXIDE_SIZE                      equ 0001h
B2SIDL_B2EXIDE_LENGTH                    equ 0001h
B2SIDL_B2EXIDE_MASK                      equ 0008h

// Register: B2EIDH
#define B2EIDH B2EIDH
B2EIDH                                   equ 0E43h
// bitfield definitions
B2EIDH_EID8_POSN                         equ 0000h
B2EIDH_EID8_POSITION                     equ 0000h
B2EIDH_EID8_SIZE                         equ 0001h
B2EIDH_EID8_LENGTH                       equ 0001h
B2EIDH_EID8_MASK                         equ 0001h
B2EIDH_EID9_POSN                         equ 0001h
B2EIDH_EID9_POSITION                     equ 0001h
B2EIDH_EID9_SIZE                         equ 0001h
B2EIDH_EID9_LENGTH                       equ 0001h
B2EIDH_EID9_MASK                         equ 0002h
B2EIDH_EID10_POSN                        equ 0002h
B2EIDH_EID10_POSITION                    equ 0002h
B2EIDH_EID10_SIZE                        equ 0001h
B2EIDH_EID10_LENGTH                      equ 0001h
B2EIDH_EID10_MASK                        equ 0004h
B2EIDH_EID11_POSN                        equ 0003h
B2EIDH_EID11_POSITION                    equ 0003h
B2EIDH_EID11_SIZE                        equ 0001h
B2EIDH_EID11_LENGTH                      equ 0001h
B2EIDH_EID11_MASK                        equ 0008h
B2EIDH_EID12_POSN                        equ 0004h
B2EIDH_EID12_POSITION                    equ 0004h
B2EIDH_EID12_SIZE                        equ 0001h
B2EIDH_EID12_LENGTH                      equ 0001h
B2EIDH_EID12_MASK                        equ 0010h
B2EIDH_EID13_POSN                        equ 0005h
B2EIDH_EID13_POSITION                    equ 0005h
B2EIDH_EID13_SIZE                        equ 0001h
B2EIDH_EID13_LENGTH                      equ 0001h
B2EIDH_EID13_MASK                        equ 0020h
B2EIDH_EID14_POSN                        equ 0006h
B2EIDH_EID14_POSITION                    equ 0006h
B2EIDH_EID14_SIZE                        equ 0001h
B2EIDH_EID14_LENGTH                      equ 0001h
B2EIDH_EID14_MASK                        equ 0040h
B2EIDH_EID15_POSN                        equ 0007h
B2EIDH_EID15_POSITION                    equ 0007h
B2EIDH_EID15_SIZE                        equ 0001h
B2EIDH_EID15_LENGTH                      equ 0001h
B2EIDH_EID15_MASK                        equ 0080h
B2EIDH_B2EID8_POSN                       equ 0000h
B2EIDH_B2EID8_POSITION                   equ 0000h
B2EIDH_B2EID8_SIZE                       equ 0001h
B2EIDH_B2EID8_LENGTH                     equ 0001h
B2EIDH_B2EID8_MASK                       equ 0001h
B2EIDH_B2EID9_POSN                       equ 0001h
B2EIDH_B2EID9_POSITION                   equ 0001h
B2EIDH_B2EID9_SIZE                       equ 0001h
B2EIDH_B2EID9_LENGTH                     equ 0001h
B2EIDH_B2EID9_MASK                       equ 0002h
B2EIDH_B2EID10_POSN                      equ 0002h
B2EIDH_B2EID10_POSITION                  equ 0002h
B2EIDH_B2EID10_SIZE                      equ 0001h
B2EIDH_B2EID10_LENGTH                    equ 0001h
B2EIDH_B2EID10_MASK                      equ 0004h
B2EIDH_B2EID11_POSN                      equ 0003h
B2EIDH_B2EID11_POSITION                  equ 0003h
B2EIDH_B2EID11_SIZE                      equ 0001h
B2EIDH_B2EID11_LENGTH                    equ 0001h
B2EIDH_B2EID11_MASK                      equ 0008h
B2EIDH_B2EID12_POSN                      equ 0004h
B2EIDH_B2EID12_POSITION                  equ 0004h
B2EIDH_B2EID12_SIZE                      equ 0001h
B2EIDH_B2EID12_LENGTH                    equ 0001h
B2EIDH_B2EID12_MASK                      equ 0010h
B2EIDH_B2EID13_POSN                      equ 0005h
B2EIDH_B2EID13_POSITION                  equ 0005h
B2EIDH_B2EID13_SIZE                      equ 0001h
B2EIDH_B2EID13_LENGTH                    equ 0001h
B2EIDH_B2EID13_MASK                      equ 0020h
B2EIDH_B2EID14_POSN                      equ 0006h
B2EIDH_B2EID14_POSITION                  equ 0006h
B2EIDH_B2EID14_SIZE                      equ 0001h
B2EIDH_B2EID14_LENGTH                    equ 0001h
B2EIDH_B2EID14_MASK                      equ 0040h
B2EIDH_B2EID15_POSN                      equ 0007h
B2EIDH_B2EID15_POSITION                  equ 0007h
B2EIDH_B2EID15_SIZE                      equ 0001h
B2EIDH_B2EID15_LENGTH                    equ 0001h
B2EIDH_B2EID15_MASK                      equ 0080h

// Register: B2EIDL
#define B2EIDL B2EIDL
B2EIDL                                   equ 0E44h
// bitfield definitions
B2EIDL_EID0_POSN                         equ 0000h
B2EIDL_EID0_POSITION                     equ 0000h
B2EIDL_EID0_SIZE                         equ 0001h
B2EIDL_EID0_LENGTH                       equ 0001h
B2EIDL_EID0_MASK                         equ 0001h
B2EIDL_EID1_POSN                         equ 0001h
B2EIDL_EID1_POSITION                     equ 0001h
B2EIDL_EID1_SIZE                         equ 0001h
B2EIDL_EID1_LENGTH                       equ 0001h
B2EIDL_EID1_MASK                         equ 0002h
B2EIDL_EID2_POSN                         equ 0002h
B2EIDL_EID2_POSITION                     equ 0002h
B2EIDL_EID2_SIZE                         equ 0001h
B2EIDL_EID2_LENGTH                       equ 0001h
B2EIDL_EID2_MASK                         equ 0004h
B2EIDL_EID3_POSN                         equ 0003h
B2EIDL_EID3_POSITION                     equ 0003h
B2EIDL_EID3_SIZE                         equ 0001h
B2EIDL_EID3_LENGTH                       equ 0001h
B2EIDL_EID3_MASK                         equ 0008h
B2EIDL_EID4_POSN                         equ 0004h
B2EIDL_EID4_POSITION                     equ 0004h
B2EIDL_EID4_SIZE                         equ 0001h
B2EIDL_EID4_LENGTH                       equ 0001h
B2EIDL_EID4_MASK                         equ 0010h
B2EIDL_EID5_POSN                         equ 0005h
B2EIDL_EID5_POSITION                     equ 0005h
B2EIDL_EID5_SIZE                         equ 0001h
B2EIDL_EID5_LENGTH                       equ 0001h
B2EIDL_EID5_MASK                         equ 0020h
B2EIDL_EID6_POSN                         equ 0006h
B2EIDL_EID6_POSITION                     equ 0006h
B2EIDL_EID6_SIZE                         equ 0001h
B2EIDL_EID6_LENGTH                       equ 0001h
B2EIDL_EID6_MASK                         equ 0040h
B2EIDL_EID7_POSN                         equ 0007h
B2EIDL_EID7_POSITION                     equ 0007h
B2EIDL_EID7_SIZE                         equ 0001h
B2EIDL_EID7_LENGTH                       equ 0001h
B2EIDL_EID7_MASK                         equ 0080h
B2EIDL_B2EID0_POSN                       equ 0000h
B2EIDL_B2EID0_POSITION                   equ 0000h
B2EIDL_B2EID0_SIZE                       equ 0001h
B2EIDL_B2EID0_LENGTH                     equ 0001h
B2EIDL_B2EID0_MASK                       equ 0001h
B2EIDL_B2EID1_POSN                       equ 0001h
B2EIDL_B2EID1_POSITION                   equ 0001h
B2EIDL_B2EID1_SIZE                       equ 0001h
B2EIDL_B2EID1_LENGTH                     equ 0001h
B2EIDL_B2EID1_MASK                       equ 0002h
B2EIDL_B2EID2_POSN                       equ 0002h
B2EIDL_B2EID2_POSITION                   equ 0002h
B2EIDL_B2EID2_SIZE                       equ 0001h
B2EIDL_B2EID2_LENGTH                     equ 0001h
B2EIDL_B2EID2_MASK                       equ 0004h
B2EIDL_B2EID3_POSN                       equ 0003h
B2EIDL_B2EID3_POSITION                   equ 0003h
B2EIDL_B2EID3_SIZE                       equ 0001h
B2EIDL_B2EID3_LENGTH                     equ 0001h
B2EIDL_B2EID3_MASK                       equ 0008h
B2EIDL_B2EID4_POSN                       equ 0004h
B2EIDL_B2EID4_POSITION                   equ 0004h
B2EIDL_B2EID4_SIZE                       equ 0001h
B2EIDL_B2EID4_LENGTH                     equ 0001h
B2EIDL_B2EID4_MASK                       equ 0010h
B2EIDL_B2EID5_POSN                       equ 0005h
B2EIDL_B2EID5_POSITION                   equ 0005h
B2EIDL_B2EID5_SIZE                       equ 0001h
B2EIDL_B2EID5_LENGTH                     equ 0001h
B2EIDL_B2EID5_MASK                       equ 0020h
B2EIDL_B2EID6_POSN                       equ 0006h
B2EIDL_B2EID6_POSITION                   equ 0006h
B2EIDL_B2EID6_SIZE                       equ 0001h
B2EIDL_B2EID6_LENGTH                     equ 0001h
B2EIDL_B2EID6_MASK                       equ 0040h
B2EIDL_B2EID7_POSN                       equ 0007h
B2EIDL_B2EID7_POSITION                   equ 0007h
B2EIDL_B2EID7_SIZE                       equ 0001h
B2EIDL_B2EID7_LENGTH                     equ 0001h
B2EIDL_B2EID7_MASK                       equ 0080h

// Register: B2DLC
#define B2DLC B2DLC
B2DLC                                    equ 0E45h
// bitfield definitions
B2DLC_DLC0_POSN                          equ 0000h
B2DLC_DLC0_POSITION                      equ 0000h
B2DLC_DLC0_SIZE                          equ 0001h
B2DLC_DLC0_LENGTH                        equ 0001h
B2DLC_DLC0_MASK                          equ 0001h
B2DLC_DLC1_POSN                          equ 0001h
B2DLC_DLC1_POSITION                      equ 0001h
B2DLC_DLC1_SIZE                          equ 0001h
B2DLC_DLC1_LENGTH                        equ 0001h
B2DLC_DLC1_MASK                          equ 0002h
B2DLC_DLC2_POSN                          equ 0002h
B2DLC_DLC2_POSITION                      equ 0002h
B2DLC_DLC2_SIZE                          equ 0001h
B2DLC_DLC2_LENGTH                        equ 0001h
B2DLC_DLC2_MASK                          equ 0004h
B2DLC_DLC3_POSN                          equ 0003h
B2DLC_DLC3_POSITION                      equ 0003h
B2DLC_DLC3_SIZE                          equ 0001h
B2DLC_DLC3_LENGTH                        equ 0001h
B2DLC_DLC3_MASK                          equ 0008h
B2DLC_RB0_POSN                           equ 0004h
B2DLC_RB0_POSITION                       equ 0004h
B2DLC_RB0_SIZE                           equ 0001h
B2DLC_RB0_LENGTH                         equ 0001h
B2DLC_RB0_MASK                           equ 0010h
B2DLC_RB1_POSN                           equ 0005h
B2DLC_RB1_POSITION                       equ 0005h
B2DLC_RB1_SIZE                           equ 0001h
B2DLC_RB1_LENGTH                         equ 0001h
B2DLC_RB1_MASK                           equ 0020h
B2DLC_RXRTR_TXRTR_POSN                   equ 0006h
B2DLC_RXRTR_TXRTR_POSITION               equ 0006h
B2DLC_RXRTR_TXRTR_SIZE                   equ 0001h
B2DLC_RXRTR_TXRTR_LENGTH                 equ 0001h
B2DLC_RXRTR_TXRTR_MASK                   equ 0040h
B2DLC_RESRB0_POSN                        equ 0004h
B2DLC_RESRB0_POSITION                    equ 0004h
B2DLC_RESRB0_SIZE                        equ 0001h
B2DLC_RESRB0_LENGTH                      equ 0001h
B2DLC_RESRB0_MASK                        equ 0010h
B2DLC_RESRB1_POSN                        equ 0005h
B2DLC_RESRB1_POSITION                    equ 0005h
B2DLC_RESRB1_SIZE                        equ 0001h
B2DLC_RESRB1_LENGTH                      equ 0001h
B2DLC_RESRB1_MASK                        equ 0020h
B2DLC_TXRTR_POSN                         equ 0006h
B2DLC_TXRTR_POSITION                     equ 0006h
B2DLC_TXRTR_SIZE                         equ 0001h
B2DLC_TXRTR_LENGTH                       equ 0001h
B2DLC_TXRTR_MASK                         equ 0040h
B2DLC_RXRTR_POSN                         equ 0006h
B2DLC_RXRTR_POSITION                     equ 0006h
B2DLC_RXRTR_SIZE                         equ 0001h
B2DLC_RXRTR_LENGTH                       equ 0001h
B2DLC_RXRTR_MASK                         equ 0040h
B2DLC_B2DLC0_POSN                        equ 0000h
B2DLC_B2DLC0_POSITION                    equ 0000h
B2DLC_B2DLC0_SIZE                        equ 0001h
B2DLC_B2DLC0_LENGTH                      equ 0001h
B2DLC_B2DLC0_MASK                        equ 0001h
B2DLC_B2DLC1_POSN                        equ 0001h
B2DLC_B2DLC1_POSITION                    equ 0001h
B2DLC_B2DLC1_SIZE                        equ 0001h
B2DLC_B2DLC1_LENGTH                      equ 0001h
B2DLC_B2DLC1_MASK                        equ 0002h
B2DLC_B2DLC2_POSN                        equ 0002h
B2DLC_B2DLC2_POSITION                    equ 0002h
B2DLC_B2DLC2_SIZE                        equ 0001h
B2DLC_B2DLC2_LENGTH                      equ 0001h
B2DLC_B2DLC2_MASK                        equ 0004h
B2DLC_B2DLC3_POSN                        equ 0003h
B2DLC_B2DLC3_POSITION                    equ 0003h
B2DLC_B2DLC3_SIZE                        equ 0001h
B2DLC_B2DLC3_LENGTH                      equ 0001h
B2DLC_B2DLC3_MASK                        equ 0008h
B2DLC_B2RB0_POSN                         equ 0004h
B2DLC_B2RB0_POSITION                     equ 0004h
B2DLC_B2RB0_SIZE                         equ 0001h
B2DLC_B2RB0_LENGTH                       equ 0001h
B2DLC_B2RB0_MASK                         equ 0010h
B2DLC_B2RB1_POSN                         equ 0005h
B2DLC_B2RB1_POSITION                     equ 0005h
B2DLC_B2RB1_SIZE                         equ 0001h
B2DLC_B2RB1_LENGTH                       equ 0001h
B2DLC_B2RB1_MASK                         equ 0020h
B2DLC_B2RXRTR_POSN                       equ 0006h
B2DLC_B2RXRTR_POSITION                   equ 0006h
B2DLC_B2RXRTR_SIZE                       equ 0001h
B2DLC_B2RXRTR_LENGTH                     equ 0001h
B2DLC_B2RXRTR_MASK                       equ 0040h

// Register: B2D0
#define B2D0 B2D0
B2D0                                     equ 0E46h
// bitfield definitions
B2D0_B2D00_POSN                          equ 0000h
B2D0_B2D00_POSITION                      equ 0000h
B2D0_B2D00_SIZE                          equ 0001h
B2D0_B2D00_LENGTH                        equ 0001h
B2D0_B2D00_MASK                          equ 0001h
B2D0_B2D01_POSN                          equ 0001h
B2D0_B2D01_POSITION                      equ 0001h
B2D0_B2D01_SIZE                          equ 0001h
B2D0_B2D01_LENGTH                        equ 0001h
B2D0_B2D01_MASK                          equ 0002h
B2D0_B2D02_POSN                          equ 0002h
B2D0_B2D02_POSITION                      equ 0002h
B2D0_B2D02_SIZE                          equ 0001h
B2D0_B2D02_LENGTH                        equ 0001h
B2D0_B2D02_MASK                          equ 0004h
B2D0_B2D03_POSN                          equ 0003h
B2D0_B2D03_POSITION                      equ 0003h
B2D0_B2D03_SIZE                          equ 0001h
B2D0_B2D03_LENGTH                        equ 0001h
B2D0_B2D03_MASK                          equ 0008h
B2D0_B2D04_POSN                          equ 0004h
B2D0_B2D04_POSITION                      equ 0004h
B2D0_B2D04_SIZE                          equ 0001h
B2D0_B2D04_LENGTH                        equ 0001h
B2D0_B2D04_MASK                          equ 0010h
B2D0_B2D05_POSN                          equ 0005h
B2D0_B2D05_POSITION                      equ 0005h
B2D0_B2D05_SIZE                          equ 0001h
B2D0_B2D05_LENGTH                        equ 0001h
B2D0_B2D05_MASK                          equ 0020h
B2D0_B2D06_POSN                          equ 0006h
B2D0_B2D06_POSITION                      equ 0006h
B2D0_B2D06_SIZE                          equ 0001h
B2D0_B2D06_LENGTH                        equ 0001h
B2D0_B2D06_MASK                          equ 0040h
B2D0_B2D07_POSN                          equ 0007h
B2D0_B2D07_POSITION                      equ 0007h
B2D0_B2D07_SIZE                          equ 0001h
B2D0_B2D07_LENGTH                        equ 0001h
B2D0_B2D07_MASK                          equ 0080h

// Register: B2D1
#define B2D1 B2D1
B2D1                                     equ 0E47h
// bitfield definitions
B2D1_B2D10_POSN                          equ 0000h
B2D1_B2D10_POSITION                      equ 0000h
B2D1_B2D10_SIZE                          equ 0001h
B2D1_B2D10_LENGTH                        equ 0001h
B2D1_B2D10_MASK                          equ 0001h
B2D1_B2D11_POSN                          equ 0001h
B2D1_B2D11_POSITION                      equ 0001h
B2D1_B2D11_SIZE                          equ 0001h
B2D1_B2D11_LENGTH                        equ 0001h
B2D1_B2D11_MASK                          equ 0002h
B2D1_B2D12_POSN                          equ 0002h
B2D1_B2D12_POSITION                      equ 0002h
B2D1_B2D12_SIZE                          equ 0001h
B2D1_B2D12_LENGTH                        equ 0001h
B2D1_B2D12_MASK                          equ 0004h
B2D1_B2D13_POSN                          equ 0003h
B2D1_B2D13_POSITION                      equ 0003h
B2D1_B2D13_SIZE                          equ 0001h
B2D1_B2D13_LENGTH                        equ 0001h
B2D1_B2D13_MASK                          equ 0008h
B2D1_B2D14_POSN                          equ 0004h
B2D1_B2D14_POSITION                      equ 0004h
B2D1_B2D14_SIZE                          equ 0001h
B2D1_B2D14_LENGTH                        equ 0001h
B2D1_B2D14_MASK                          equ 0010h
B2D1_B2D15_POSN                          equ 0005h
B2D1_B2D15_POSITION                      equ 0005h
B2D1_B2D15_SIZE                          equ 0001h
B2D1_B2D15_LENGTH                        equ 0001h
B2D1_B2D15_MASK                          equ 0020h
B2D1_B2D16_POSN                          equ 0006h
B2D1_B2D16_POSITION                      equ 0006h
B2D1_B2D16_SIZE                          equ 0001h
B2D1_B2D16_LENGTH                        equ 0001h
B2D1_B2D16_MASK                          equ 0040h
B2D1_B2D17_POSN                          equ 0007h
B2D1_B2D17_POSITION                      equ 0007h
B2D1_B2D17_SIZE                          equ 0001h
B2D1_B2D17_LENGTH                        equ 0001h
B2D1_B2D17_MASK                          equ 0080h

// Register: B2D2
#define B2D2 B2D2
B2D2                                     equ 0E48h
// bitfield definitions
B2D2_B2D20_POSN                          equ 0000h
B2D2_B2D20_POSITION                      equ 0000h
B2D2_B2D20_SIZE                          equ 0001h
B2D2_B2D20_LENGTH                        equ 0001h
B2D2_B2D20_MASK                          equ 0001h
B2D2_B2D21_POSN                          equ 0001h
B2D2_B2D21_POSITION                      equ 0001h
B2D2_B2D21_SIZE                          equ 0001h
B2D2_B2D21_LENGTH                        equ 0001h
B2D2_B2D21_MASK                          equ 0002h
B2D2_B2D22_POSN                          equ 0002h
B2D2_B2D22_POSITION                      equ 0002h
B2D2_B2D22_SIZE                          equ 0001h
B2D2_B2D22_LENGTH                        equ 0001h
B2D2_B2D22_MASK                          equ 0004h
B2D2_B2D23_POSN                          equ 0003h
B2D2_B2D23_POSITION                      equ 0003h
B2D2_B2D23_SIZE                          equ 0001h
B2D2_B2D23_LENGTH                        equ 0001h
B2D2_B2D23_MASK                          equ 0008h
B2D2_B2D24_POSN                          equ 0004h
B2D2_B2D24_POSITION                      equ 0004h
B2D2_B2D24_SIZE                          equ 0001h
B2D2_B2D24_LENGTH                        equ 0001h
B2D2_B2D24_MASK                          equ 0010h
B2D2_B2D25_POSN                          equ 0005h
B2D2_B2D25_POSITION                      equ 0005h
B2D2_B2D25_SIZE                          equ 0001h
B2D2_B2D25_LENGTH                        equ 0001h
B2D2_B2D25_MASK                          equ 0020h
B2D2_B2D26_POSN                          equ 0006h
B2D2_B2D26_POSITION                      equ 0006h
B2D2_B2D26_SIZE                          equ 0001h
B2D2_B2D26_LENGTH                        equ 0001h
B2D2_B2D26_MASK                          equ 0040h
B2D2_B2D27_POSN                          equ 0007h
B2D2_B2D27_POSITION                      equ 0007h
B2D2_B2D27_SIZE                          equ 0001h
B2D2_B2D27_LENGTH                        equ 0001h
B2D2_B2D27_MASK                          equ 0080h

