GopalSaraf/Practicals/PSDL/include/proc/pic18lf2585.inc
// Register: B4D3
#define B4D3 B4D3
B4D3                                     equ 0E69h
// bitfield definitions
B4D3_B4D30_POSN                          equ 0000h
B4D3_B4D30_POSITION                      equ 0000h
B4D3_B4D30_SIZE                          equ 0001h
B4D3_B4D30_LENGTH                        equ 0001h
B4D3_B4D30_MASK                          equ 0001h
B4D3_B4D31_POSN                          equ 0001h
B4D3_B4D31_POSITION                      equ 0001h
B4D3_B4D31_SIZE                          equ 0001h
B4D3_B4D31_LENGTH                        equ 0001h
B4D3_B4D31_MASK                          equ 0002h
B4D3_B4D32_POSN                          equ 0002h
B4D3_B4D32_POSITION                      equ 0002h
B4D3_B4D32_SIZE                          equ 0001h
B4D3_B4D32_LENGTH                        equ 0001h
B4D3_B4D32_MASK                          equ 0004h
B4D3_B4D33_POSN                          equ 0003h
B4D3_B4D33_POSITION                      equ 0003h
B4D3_B4D33_SIZE                          equ 0001h
B4D3_B4D33_LENGTH                        equ 0001h
B4D3_B4D33_MASK                          equ 0008h
B4D3_B4D34_POSN                          equ 0004h
B4D3_B4D34_POSITION                      equ 0004h
B4D3_B4D34_SIZE                          equ 0001h
B4D3_B4D34_LENGTH                        equ 0001h
B4D3_B4D34_MASK                          equ 0010h
B4D3_B4D35_POSN                          equ 0005h
B4D3_B4D35_POSITION                      equ 0005h
B4D3_B4D35_SIZE                          equ 0001h
B4D3_B4D35_LENGTH                        equ 0001h
B4D3_B4D35_MASK                          equ 0020h
B4D3_B4D36_POSN                          equ 0006h
B4D3_B4D36_POSITION                      equ 0006h
B4D3_B4D36_SIZE                          equ 0001h
B4D3_B4D36_LENGTH                        equ 0001h
B4D3_B4D36_MASK                          equ 0040h
B4D3_B4D37_POSN                          equ 0007h
B4D3_B4D37_POSITION                      equ 0007h
B4D3_B4D37_SIZE                          equ 0001h
B4D3_B4D37_LENGTH                        equ 0001h
B4D3_B4D37_MASK                          equ 0080h

// Register: B4D4
#define B4D4 B4D4
B4D4                                     equ 0E6Ah
// bitfield definitions
B4D4_B4D40_POSN                          equ 0000h
B4D4_B4D40_POSITION                      equ 0000h
B4D4_B4D40_SIZE                          equ 0001h
B4D4_B4D40_LENGTH                        equ 0001h
B4D4_B4D40_MASK                          equ 0001h
B4D4_B4D41_POSN                          equ 0001h
B4D4_B4D41_POSITION                      equ 0001h
B4D4_B4D41_SIZE                          equ 0001h
B4D4_B4D41_LENGTH                        equ 0001h
B4D4_B4D41_MASK                          equ 0002h
B4D4_B4D42_POSN                          equ 0002h
B4D4_B4D42_POSITION                      equ 0002h
B4D4_B4D42_SIZE                          equ 0001h
B4D4_B4D42_LENGTH                        equ 0001h
B4D4_B4D42_MASK                          equ 0004h
B4D4_B4D43_POSN                          equ 0003h
B4D4_B4D43_POSITION                      equ 0003h
B4D4_B4D43_SIZE                          equ 0001h
B4D4_B4D43_LENGTH                        equ 0001h
B4D4_B4D43_MASK                          equ 0008h
B4D4_B4D44_POSN                          equ 0004h
B4D4_B4D44_POSITION                      equ 0004h
B4D4_B4D44_SIZE                          equ 0001h
B4D4_B4D44_LENGTH                        equ 0001h
B4D4_B4D44_MASK                          equ 0010h
B4D4_B4D45_POSN                          equ 0005h
B4D4_B4D45_POSITION                      equ 0005h
B4D4_B4D45_SIZE                          equ 0001h
B4D4_B4D45_LENGTH                        equ 0001h
B4D4_B4D45_MASK                          equ 0020h
B4D4_B4D46_POSN                          equ 0006h
B4D4_B4D46_POSITION                      equ 0006h
B4D4_B4D46_SIZE                          equ 0001h
B4D4_B4D46_LENGTH                        equ 0001h
B4D4_B4D46_MASK                          equ 0040h
B4D4_B4D47_POSN                          equ 0007h
B4D4_B4D47_POSITION                      equ 0007h
B4D4_B4D47_SIZE                          equ 0001h
B4D4_B4D47_LENGTH                        equ 0001h
B4D4_B4D47_MASK                          equ 0080h

// Register: B4D5
#define B4D5 B4D5
B4D5                                     equ 0E6Bh
// bitfield definitions
B4D5_B4D50_POSN                          equ 0000h
B4D5_B4D50_POSITION                      equ 0000h
B4D5_B4D50_SIZE                          equ 0001h
B4D5_B4D50_LENGTH                        equ 0001h
B4D5_B4D50_MASK                          equ 0001h
B4D5_B4D51_POSN                          equ 0001h
B4D5_B4D51_POSITION                      equ 0001h
B4D5_B4D51_SIZE                          equ 0001h
B4D5_B4D51_LENGTH                        equ 0001h
B4D5_B4D51_MASK                          equ 0002h
B4D5_B4D52_POSN                          equ 0002h
B4D5_B4D52_POSITION                      equ 0002h
B4D5_B4D52_SIZE                          equ 0001h
B4D5_B4D52_LENGTH                        equ 0001h
B4D5_B4D52_MASK                          equ 0004h
B4D5_B4D53_POSN                          equ 0003h
B4D5_B4D53_POSITION                      equ 0003h
B4D5_B4D53_SIZE                          equ 0001h
B4D5_B4D53_LENGTH                        equ 0001h
B4D5_B4D53_MASK                          equ 0008h
B4D5_B4D54_POSN                          equ 0004h
B4D5_B4D54_POSITION                      equ 0004h
B4D5_B4D54_SIZE                          equ 0001h
B4D5_B4D54_LENGTH                        equ 0001h
B4D5_B4D54_MASK                          equ 0010h
B4D5_B4D55_POSN                          equ 0005h
B4D5_B4D55_POSITION                      equ 0005h
B4D5_B4D55_SIZE                          equ 0001h
B4D5_B4D55_LENGTH                        equ 0001h
B4D5_B4D55_MASK                          equ 0020h
B4D5_B4D56_POSN                          equ 0006h
B4D5_B4D56_POSITION                      equ 0006h
B4D5_B4D56_SIZE                          equ 0001h
B4D5_B4D56_LENGTH                        equ 0001h
B4D5_B4D56_MASK                          equ 0040h
B4D5_B4D57_POSN                          equ 0007h
B4D5_B4D57_POSITION                      equ 0007h
B4D5_B4D57_SIZE                          equ 0001h
B4D5_B4D57_LENGTH                        equ 0001h
B4D5_B4D57_MASK                          equ 0080h

// Register: B4D6
#define B4D6 B4D6
B4D6                                     equ 0E6Ch
// bitfield definitions
B4D6_B4D60_POSN                          equ 0000h
B4D6_B4D60_POSITION                      equ 0000h
B4D6_B4D60_SIZE                          equ 0001h
B4D6_B4D60_LENGTH                        equ 0001h
B4D6_B4D60_MASK                          equ 0001h
B4D6_B4D61_POSN                          equ 0001h
B4D6_B4D61_POSITION                      equ 0001h
B4D6_B4D61_SIZE                          equ 0001h
B4D6_B4D61_LENGTH                        equ 0001h
B4D6_B4D61_MASK                          equ 0002h
B4D6_B4D62_POSN                          equ 0002h
B4D6_B4D62_POSITION                      equ 0002h
B4D6_B4D62_SIZE                          equ 0001h
B4D6_B4D62_LENGTH                        equ 0001h
B4D6_B4D62_MASK                          equ 0004h
B4D6_B4D63_POSN                          equ 0003h
B4D6_B4D63_POSITION                      equ 0003h
B4D6_B4D63_SIZE                          equ 0001h
B4D6_B4D63_LENGTH                        equ 0001h
B4D6_B4D63_MASK                          equ 0008h
B4D6_B4D64_POSN                          equ 0004h
B4D6_B4D64_POSITION                      equ 0004h
B4D6_B4D64_SIZE                          equ 0001h
B4D6_B4D64_LENGTH                        equ 0001h
B4D6_B4D64_MASK                          equ 0010h
B4D6_B4D65_POSN                          equ 0005h
B4D6_B4D65_POSITION                      equ 0005h
B4D6_B4D65_SIZE                          equ 0001h
B4D6_B4D65_LENGTH                        equ 0001h
B4D6_B4D65_MASK                          equ 0020h
B4D6_B4D66_POSN                          equ 0006h
B4D6_B4D66_POSITION                      equ 0006h
B4D6_B4D66_SIZE                          equ 0001h
B4D6_B4D66_LENGTH                        equ 0001h
B4D6_B4D66_MASK                          equ 0040h
B4D6_B4D67_POSN                          equ 0007h
B4D6_B4D67_POSITION                      equ 0007h
B4D6_B4D67_SIZE                          equ 0001h
B4D6_B4D67_LENGTH                        equ 0001h
B4D6_B4D67_MASK                          equ 0080h

